MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/pwm.h
/* -------- PWM_CDTY : (PWM Offset: 0x04) (R/W 32) PWM Channel Duty Cycle Register -------- */
#define PWM_CDTY_CDTY_Pos                     _UINT32_(0)                                          /* (PWM_CDTY) Channel Duty-Cycle Position */
#define PWM_CDTY_CDTY_Msk                     (_UINT32_(0xFFFFFF) << PWM_CDTY_CDTY_Pos)            /* (PWM_CDTY) Channel Duty-Cycle Mask */
#define PWM_CDTY_CDTY(value)                  (PWM_CDTY_CDTY_Msk & (_UINT32_(value) << PWM_CDTY_CDTY_Pos)) /* Assignment of value for CDTY in the PWM_CDTY register */
#define PWM_CDTY_Msk                          _UINT32_(0x00FFFFFF)                                 /* (PWM_CDTY) Register Mask  */


/* -------- PWM_CDTYUPD : (PWM Offset: 0x08) ( /W 32) PWM Channel Duty Cycle Update Register -------- */
#define PWM_CDTYUPD_CDTYUPD_Pos               _UINT32_(0)                                          /* (PWM_CDTYUPD) Channel Duty-Cycle Update Position */
#define PWM_CDTYUPD_CDTYUPD_Msk               (_UINT32_(0xFFFFFF) << PWM_CDTYUPD_CDTYUPD_Pos)      /* (PWM_CDTYUPD) Channel Duty-Cycle Update Mask */
#define PWM_CDTYUPD_CDTYUPD(value)            (PWM_CDTYUPD_CDTYUPD_Msk & (_UINT32_(value) << PWM_CDTYUPD_CDTYUPD_Pos)) /* Assignment of value for CDTYUPD in the PWM_CDTYUPD register */
#define PWM_CDTYUPD_Msk                       _UINT32_(0x00FFFFFF)                                 /* (PWM_CDTYUPD) Register Mask  */


/* -------- PWM_CPRD : (PWM Offset: 0x0C) (R/W 32) PWM Channel Period Register -------- */
#define PWM_CPRD_CPRD_Pos                     _UINT32_(0)                                          /* (PWM_CPRD) Channel Period Position */
#define PWM_CPRD_CPRD_Msk                     (_UINT32_(0xFFFFFF) << PWM_CPRD_CPRD_Pos)            /* (PWM_CPRD) Channel Period Mask */
#define PWM_CPRD_CPRD(value)                  (PWM_CPRD_CPRD_Msk & (_UINT32_(value) << PWM_CPRD_CPRD_Pos)) /* Assignment of value for CPRD in the PWM_CPRD register */
#define PWM_CPRD_Msk                          _UINT32_(0x00FFFFFF)                                 /* (PWM_CPRD) Register Mask  */


/* -------- PWM_CPRDUPD : (PWM Offset: 0x10) ( /W 32) PWM Channel Period Update Register -------- */
#define PWM_CPRDUPD_CPRDUPD_Pos               _UINT32_(0)                                          /* (PWM_CPRDUPD) Channel Period Update Position */
#define PWM_CPRDUPD_CPRDUPD_Msk               (_UINT32_(0xFFFFFF) << PWM_CPRDUPD_CPRDUPD_Pos)      /* (PWM_CPRDUPD) Channel Period Update Mask */
#define PWM_CPRDUPD_CPRDUPD(value)            (PWM_CPRDUPD_CPRDUPD_Msk & (_UINT32_(value) << PWM_CPRDUPD_CPRDUPD_Pos)) /* Assignment of value for CPRDUPD in the PWM_CPRDUPD register */
#define PWM_CPRDUPD_Msk                       _UINT32_(0x00FFFFFF)                                 /* (PWM_CPRDUPD) Register Mask  */


/* -------- PWM_CCNT : (PWM Offset: 0x14) ( R/ 32) PWM Channel Counter Register -------- */
#define PWM_CCNT_CNT_Pos                      _UINT32_(0)                                          /* (PWM_CCNT) Channel Counter Register Position */
#define PWM_CCNT_CNT_Msk                      (_UINT32_(0xFFFFFF) << PWM_CCNT_CNT_Pos)             /* (PWM_CCNT) Channel Counter Register Mask */
#define PWM_CCNT_CNT(value)                   (PWM_CCNT_CNT_Msk & (_UINT32_(value) << PWM_CCNT_CNT_Pos)) /* Assignment of value for CNT in the PWM_CCNT register */
#define PWM_CCNT_Msk                          _UINT32_(0x00FFFFFF)                                 /* (PWM_CCNT) Register Mask  */


/* -------- PWM_DT : (PWM Offset: 0x18) (R/W 32) PWM Channel Dead Time Register -------- */
#define PWM_DT_DTH_Pos                        _UINT32_(0)                                          /* (PWM_DT) Dead-Time Value for PWMHx Output Position */
#define PWM_DT_DTH_Msk                        (_UINT32_(0xFFFF) << PWM_DT_DTH_Pos)                 /* (PWM_DT) Dead-Time Value for PWMHx Output Mask */
#define PWM_DT_DTH(value)                     (PWM_DT_DTH_Msk & (_UINT32_(value) << PWM_DT_DTH_Pos)) /* Assignment of value for DTH in the PWM_DT register */
#define PWM_DT_DTL_Pos                        _UINT32_(16)                                         /* (PWM_DT) Dead-Time Value for PWMLx Output Position */
#define PWM_DT_DTL_Msk                        (_UINT32_(0xFFFF) << PWM_DT_DTL_Pos)                 /* (PWM_DT) Dead-Time Value for PWMLx Output Mask */
#define PWM_DT_DTL(value)                     (PWM_DT_DTL_Msk & (_UINT32_(value) << PWM_DT_DTL_Pos)) /* Assignment of value for DTL in the PWM_DT register */
#define PWM_DT_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (PWM_DT) Register Mask  */


/* -------- PWM_DTUPD : (PWM Offset: 0x1C) ( /W 32) PWM Channel Dead Time Update Register -------- */
#define PWM_DTUPD_DTHUPD_Pos                  _UINT32_(0)                                          /* (PWM_DTUPD) Dead-Time Value Update for PWMHx Output Position */
#define PWM_DTUPD_DTHUPD_Msk                  (_UINT32_(0xFFFF) << PWM_DTUPD_DTHUPD_Pos)           /* (PWM_DTUPD) Dead-Time Value Update for PWMHx Output Mask */
#define PWM_DTUPD_DTHUPD(value)               (PWM_DTUPD_DTHUPD_Msk & (_UINT32_(value) << PWM_DTUPD_DTHUPD_Pos)) /* Assignment of value for DTHUPD in the PWM_DTUPD register */
#define PWM_DTUPD_DTLUPD_Pos                  _UINT32_(16)                                         /* (PWM_DTUPD) Dead-Time Value Update for PWMLx Output Position */
#define PWM_DTUPD_DTLUPD_Msk                  (_UINT32_(0xFFFF) << PWM_DTUPD_DTLUPD_Pos)           /* (PWM_DTUPD) Dead-Time Value Update for PWMLx Output Mask */
#define PWM_DTUPD_DTLUPD(value)               (PWM_DTUPD_DTLUPD_Msk & (_UINT32_(value) << PWM_DTUPD_DTLUPD_Pos)) /* Assignment of value for DTLUPD in the PWM_DTUPD register */
#define PWM_DTUPD_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (PWM_DTUPD) Register Mask  */


/* -------- PWM_CMPV : (PWM Offset: 0x00) (R/W 32) PWM Comparison 0 Value Register -------- */
#define PWM_CMPV_CV_Pos                       _UINT32_(0)                                          /* (PWM_CMPV) Comparison x Value Position */
#define PWM_CMPV_CV_Msk                       (_UINT32_(0xFFFFFF) << PWM_CMPV_CV_Pos)              /* (PWM_CMPV) Comparison x Value Mask */
#define PWM_CMPV_CV(value)                    (PWM_CMPV_CV_Msk & (_UINT32_(value) << PWM_CMPV_CV_Pos)) /* Assignment of value for CV in the PWM_CMPV register */
#define PWM_CMPV_CVM_Pos                      _UINT32_(24)                                         /* (PWM_CMPV) Comparison x Value Mode Position */
#define PWM_CMPV_CVM_Msk                      (_UINT32_(0x1) << PWM_CMPV_CVM_Pos)                  /* (PWM_CMPV) Comparison x Value Mode Mask */
#define PWM_CMPV_CVM(value)                   (PWM_CMPV_CVM_Msk & (_UINT32_(value) << PWM_CMPV_CVM_Pos)) /* Assignment of value for CVM in the PWM_CMPV register */
#define   PWM_CMPV_CVM_COMPARE_AT_INCREMENT_Val _UINT32_(0x0)                                        /* (PWM_CMPV) Compare when counter is incrementing  */
#define   PWM_CMPV_CVM_COMPARE_AT_DECREMENT_Val _UINT32_(0x1)                                        /* (PWM_CMPV) Compare when counter is decrementing  */
#define PWM_CMPV_CVM_COMPARE_AT_INCREMENT     (PWM_CMPV_CVM_COMPARE_AT_INCREMENT_Val << PWM_CMPV_CVM_Pos) /* (PWM_CMPV) Compare when counter is incrementing Position */
#define PWM_CMPV_CVM_COMPARE_AT_DECREMENT     (PWM_CMPV_CVM_COMPARE_AT_DECREMENT_Val << PWM_CMPV_CVM_Pos) /* (PWM_CMPV) Compare when counter is decrementing Position */
#define PWM_CMPV_Msk                          _UINT32_(0x01FFFFFF)                                 /* (PWM_CMPV) Register Mask  */


/* -------- PWM_CMPVUPD : (PWM Offset: 0x04) ( /W 32) PWM Comparison 0 Value Update Register -------- */
#define PWM_CMPVUPD_CVUPD_Pos                 _UINT32_(0)                                          /* (PWM_CMPVUPD) Comparison x Value Update Position */
#define PWM_CMPVUPD_CVUPD_Msk                 (_UINT32_(0xFFFFFF) << PWM_CMPVUPD_CVUPD_Pos)        /* (PWM_CMPVUPD) Comparison x Value Update Mask */
#define PWM_CMPVUPD_CVUPD(value)              (PWM_CMPVUPD_CVUPD_Msk & (_UINT32_(value) << PWM_CMPVUPD_CVUPD_Pos)) /* Assignment of value for CVUPD in the PWM_CMPVUPD register */
#define PWM_CMPVUPD_CVMUPD_Pos                _UINT32_(24)                                         /* (PWM_CMPVUPD) Comparison x Value Mode Update Position */
#define PWM_CMPVUPD_CVMUPD_Msk                (_UINT32_(0x1) << PWM_CMPVUPD_CVMUPD_Pos)            /* (PWM_CMPVUPD) Comparison x Value Mode Update Mask */
#define PWM_CMPVUPD_CVMUPD(value)             (PWM_CMPVUPD_CVMUPD_Msk & (_UINT32_(value) << PWM_CMPVUPD_CVMUPD_Pos)) /* Assignment of value for CVMUPD in the PWM_CMPVUPD register */
#define PWM_CMPVUPD_Msk                       _UINT32_(0x01FFFFFF)                                 /* (PWM_CMPVUPD) Register Mask  */


/* -------- PWM_CMPM : (PWM Offset: 0x08) (R/W 32) PWM Comparison 0 Mode Register -------- */
#define PWM_CMPM_CEN_Pos                      _UINT32_(0)                                          /* (PWM_CMPM) Comparison x Enable Position */
#define PWM_CMPM_CEN_Msk                      (_UINT32_(0x1) << PWM_CMPM_CEN_Pos)                  /* (PWM_CMPM) Comparison x Enable Mask */
#define PWM_CMPM_CEN(value)                   (PWM_CMPM_CEN_Msk & (_UINT32_(value) << PWM_CMPM_CEN_Pos)) /* Assignment of value for CEN in the PWM_CMPM register */
#define PWM_CMPM_CTR_Pos                      _UINT32_(4)                                          /* (PWM_CMPM) Comparison x Trigger Position */
#define PWM_CMPM_CTR_Msk                      (_UINT32_(0xF) << PWM_CMPM_CTR_Pos)                  /* (PWM_CMPM) Comparison x Trigger Mask */
#define PWM_CMPM_CTR(value)                   (PWM_CMPM_CTR_Msk & (_UINT32_(value) << PWM_CMPM_CTR_Pos)) /* Assignment of value for CTR in the PWM_CMPM register */
#define PWM_CMPM_CPR_Pos                      _UINT32_(8)                                          /* (PWM_CMPM) Comparison x Period Position */
#define PWM_CMPM_CPR_Msk                      (_UINT32_(0xF) << PWM_CMPM_CPR_Pos)                  /* (PWM_CMPM) Comparison x Period Mask */
#define PWM_CMPM_CPR(value)                   (PWM_CMPM_CPR_Msk & (_UINT32_(value) << PWM_CMPM_CPR_Pos)) /* Assignment of value for CPR in the PWM_CMPM register */
#define PWM_CMPM_CPRCNT_Pos                   _UINT32_(12)                                         /* (PWM_CMPM) Comparison x Period Counter Position */
#define PWM_CMPM_CPRCNT_Msk                   (_UINT32_(0xF) << PWM_CMPM_CPRCNT_Pos)               /* (PWM_CMPM) Comparison x Period Counter Mask */
#define PWM_CMPM_CPRCNT(value)                (PWM_CMPM_CPRCNT_Msk & (_UINT32_(value) << PWM_CMPM_CPRCNT_Pos)) /* Assignment of value for CPRCNT in the PWM_CMPM register */
#define PWM_CMPM_CUPR_Pos                     _UINT32_(16)                                         /* (PWM_CMPM) Comparison x Update Period Position */
#define PWM_CMPM_CUPR_Msk                     (_UINT32_(0xF) << PWM_CMPM_CUPR_Pos)                 /* (PWM_CMPM) Comparison x Update Period Mask */
#define PWM_CMPM_CUPR(value)                  (PWM_CMPM_CUPR_Msk & (_UINT32_(value) << PWM_CMPM_CUPR_Pos)) /* Assignment of value for CUPR in the PWM_CMPM register */
#define PWM_CMPM_CUPRCNT_Pos                  _UINT32_(20)                                         /* (PWM_CMPM) Comparison x Update Period Counter Position */
#define PWM_CMPM_CUPRCNT_Msk                  (_UINT32_(0xF) << PWM_CMPM_CUPRCNT_Pos)              /* (PWM_CMPM) Comparison x Update Period Counter Mask */
#define PWM_CMPM_CUPRCNT(value)               (PWM_CMPM_CUPRCNT_Msk & (_UINT32_(value) << PWM_CMPM_CUPRCNT_Pos)) /* Assignment of value for CUPRCNT in the PWM_CMPM register */
#define PWM_CMPM_Msk                          _UINT32_(0x00FFFFF1)                                 /* (PWM_CMPM) Register Mask  */


/* -------- PWM_CMPMUPD : (PWM Offset: 0x0C) ( /W 32) PWM Comparison 0 Mode Update Register -------- */
#define PWM_CMPMUPD_CENUPD_Pos                _UINT32_(0)                                          /* (PWM_CMPMUPD) Comparison x Enable Update Position */
#define PWM_CMPMUPD_CENUPD_Msk                (_UINT32_(0x1) << PWM_CMPMUPD_CENUPD_Pos)            /* (PWM_CMPMUPD) Comparison x Enable Update Mask */
#define PWM_CMPMUPD_CENUPD(value)             (PWM_CMPMUPD_CENUPD_Msk & (_UINT32_(value) << PWM_CMPMUPD_CENUPD_Pos)) /* Assignment of value for CENUPD in the PWM_CMPMUPD register */
#define PWM_CMPMUPD_CTRUPD_Pos                _UINT32_(4)                                          /* (PWM_CMPMUPD) Comparison x Trigger Update Position */
#define PWM_CMPMUPD_CTRUPD_Msk                (_UINT32_(0xF) << PWM_CMPMUPD_CTRUPD_Pos)            /* (PWM_CMPMUPD) Comparison x Trigger Update Mask */
#define PWM_CMPMUPD_CTRUPD(value)             (PWM_CMPMUPD_CTRUPD_Msk & (_UINT32_(value) << PWM_CMPMUPD_CTRUPD_Pos)) /* Assignment of value for CTRUPD in the PWM_CMPMUPD register */
#define PWM_CMPMUPD_CPRUPD_Pos                _UINT32_(8)                                          /* (PWM_CMPMUPD) Comparison x Period Update Position */
#define PWM_CMPMUPD_CPRUPD_Msk                (_UINT32_(0xF) << PWM_CMPMUPD_CPRUPD_Pos)            /* (PWM_CMPMUPD) Comparison x Period Update Mask */
#define PWM_CMPMUPD_CPRUPD(value)             (PWM_CMPMUPD_CPRUPD_Msk & (_UINT32_(value) << PWM_CMPMUPD_CPRUPD_Pos)) /* Assignment of value for CPRUPD in the PWM_CMPMUPD register */
#define PWM_CMPMUPD_CUPRUPD_Pos               _UINT32_(16)                                         /* (PWM_CMPMUPD) Comparison x Update Period Update Position */
#define PWM_CMPMUPD_CUPRUPD_Msk               (_UINT32_(0xF) << PWM_CMPMUPD_CUPRUPD_Pos)           /* (PWM_CMPMUPD) Comparison x Update Period Update Mask */
#define PWM_CMPMUPD_CUPRUPD(value)            (PWM_CMPMUPD_CUPRUPD_Msk & (_UINT32_(value) << PWM_CMPMUPD_CUPRUPD_Pos)) /* Assignment of value for CUPRUPD in the PWM_CMPMUPD register */
#define PWM_CMPMUPD_Msk                       _UINT32_(0x000F0FF1)                                 /* (PWM_CMPMUPD) Register Mask  */


/* -------- PWM_CLK : (PWM Offset: 0x00) (R/W 32) PWM Clock Register -------- */
#define PWM_CLK_DIVA_Pos                      _UINT32_(0)                                          /* (PWM_CLK) CLKA Divide Factor Position */
#define PWM_CLK_DIVA_Msk                      (_UINT32_(0xFF) << PWM_CLK_DIVA_Pos)                 /* (PWM_CLK) CLKA Divide Factor Mask */
#define PWM_CLK_DIVA(value)                   (PWM_CLK_DIVA_Msk & (_UINT32_(value) << PWM_CLK_DIVA_Pos)) /* Assignment of value for DIVA in the PWM_CLK register */
#define   PWM_CLK_DIVA_CLKA_POFF_Val          _UINT32_(0x0)                                        /* (PWM_CLK) CLKA clock is turned off  */
#define   PWM_CLK_DIVA_PREA_Val               _UINT32_(0x1)                                        /* (PWM_CLK) CLKA clock is clock selected by PREA  */
#define PWM_CLK_DIVA_CLKA_POFF                (PWM_CLK_DIVA_CLKA_POFF_Val << PWM_CLK_DIVA_Pos)     /* (PWM_CLK) CLKA clock is turned off Position */
#define PWM_CLK_DIVA_PREA                     (PWM_CLK_DIVA_PREA_Val << PWM_CLK_DIVA_Pos)          /* (PWM_CLK) CLKA clock is clock selected by PREA Position */
#define PWM_CLK_PREA_Pos                      _UINT32_(8)                                          /* (PWM_CLK) CLKA Source Clock Selection Position */
#define PWM_CLK_PREA_Msk                      (_UINT32_(0xF) << PWM_CLK_PREA_Pos)                  /* (PWM_CLK) CLKA Source Clock Selection Mask */
#define PWM_CLK_PREA(value)                   (PWM_CLK_PREA_Msk & (_UINT32_(value) << PWM_CLK_PREA_Pos)) /* Assignment of value for PREA in the PWM_CLK register */
#define   PWM_CLK_PREA_CLK_Val                _UINT32_(0x0)                                        /* (PWM_CLK) Peripheral clock  */
#define   PWM_CLK_PREA_CLK_DIV2_Val           _UINT32_(0x1)                                        /* (PWM_CLK) Peripheral clock/2  */
#define   PWM_CLK_PREA_CLK_DIV4_Val           _UINT32_(0x2)                                        /* (PWM_CLK) Peripheral clock/4  */
#define   PWM_CLK_PREA_CLK_DIV8_Val           _UINT32_(0x3)                                        /* (PWM_CLK) Peripheral clock/8  */
#define   PWM_CLK_PREA_CLK_DIV16_Val          _UINT32_(0x4)                                        /* (PWM_CLK) Peripheral clock/16  */
#define   PWM_CLK_PREA_CLK_DIV32_Val          _UINT32_(0x5)                                        /* (PWM_CLK) Peripheral clock/32  */
#define   PWM_CLK_PREA_CLK_DIV64_Val          _UINT32_(0x6)                                        /* (PWM_CLK) Peripheral clock/64  */
#define   PWM_CLK_PREA_CLK_DIV128_Val         _UINT32_(0x7)                                        /* (PWM_CLK) Peripheral clock/128  */
#define   PWM_CLK_PREA_CLK_DIV256_Val         _UINT32_(0x8)                                        /* (PWM_CLK) Peripheral clock/256  */
#define   PWM_CLK_PREA_CLK_DIV512_Val         _UINT32_(0x9)                                        /* (PWM_CLK) Peripheral clock/512  */
#define   PWM_CLK_PREA_CLK_DIV1024_Val        _UINT32_(0xA)                                        /* (PWM_CLK) Peripheral clock/1024  */
#define PWM_CLK_PREA_CLK                      (PWM_CLK_PREA_CLK_Val << PWM_CLK_PREA_Pos)           /* (PWM_CLK) Peripheral clock Position */
#define PWM_CLK_PREA_CLK_DIV2                 (PWM_CLK_PREA_CLK_DIV2_Val << PWM_CLK_PREA_Pos)      /* (PWM_CLK) Peripheral clock/2 Position */
#define PWM_CLK_PREA_CLK_DIV4                 (PWM_CLK_PREA_CLK_DIV4_Val << PWM_CLK_PREA_Pos)      /* (PWM_CLK) Peripheral clock/4 Position */
#define PWM_CLK_PREA_CLK_DIV8                 (PWM_CLK_PREA_CLK_DIV8_Val << PWM_CLK_PREA_Pos)      /* (PWM_CLK) Peripheral clock/8 Position */
#define PWM_CLK_PREA_CLK_DIV16                (PWM_CLK_PREA_CLK_DIV16_Val << PWM_CLK_PREA_Pos)     /* (PWM_CLK) Peripheral clock/16 Position */
#define PWM_CLK_PREA_CLK_DIV32                (PWM_CLK_PREA_CLK_DIV32_Val << PWM_CLK_PREA_Pos)     /* (PWM_CLK) Peripheral clock/32 Position */
#define PWM_CLK_PREA_CLK_DIV64                (PWM_CLK_PREA_CLK_DIV64_Val << PWM_CLK_PREA_Pos)     /* (PWM_CLK) Peripheral clock/64 Position */
#define PWM_CLK_PREA_CLK_DIV128               (PWM_CLK_PREA_CLK_DIV128_Val << PWM_CLK_PREA_Pos)    /* (PWM_CLK) Peripheral clock/128 Position */
#define PWM_CLK_PREA_CLK_DIV256               (PWM_CLK_PREA_CLK_DIV256_Val << PWM_CLK_PREA_Pos)    /* (PWM_CLK) Peripheral clock/256 Position */
#define PWM_CLK_PREA_CLK_DIV512               (PWM_CLK_PREA_CLK_DIV512_Val << PWM_CLK_PREA_Pos)    /* (PWM_CLK) Peripheral clock/512 Position */
#define PWM_CLK_PREA_CLK_DIV1024              (PWM_CLK_PREA_CLK_DIV1024_Val << PWM_CLK_PREA_Pos)   /* (PWM_CLK) Peripheral clock/1024 Position */
#define PWM_CLK_DIVB_Pos                      _UINT32_(16)                                         /* (PWM_CLK) CLKB Divide Factor Position */
#define PWM_CLK_DIVB_Msk                      (_UINT32_(0xFF) << PWM_CLK_DIVB_Pos)                 /* (PWM_CLK) CLKB Divide Factor Mask */
#define PWM_CLK_DIVB(value)                   (PWM_CLK_DIVB_Msk & (_UINT32_(value) << PWM_CLK_DIVB_Pos)) /* Assignment of value for DIVB in the PWM_CLK register */
#define   PWM_CLK_DIVB_CLKB_POFF_Val          _UINT32_(0x0)                                        /* (PWM_CLK) CLKB clock is turned off  */
#define   PWM_CLK_DIVB_PREB_Val               _UINT32_(0x1)                                        /* (PWM_CLK) CLKB clock is clock selected by PREB  */
#define PWM_CLK_DIVB_CLKB_POFF                (PWM_CLK_DIVB_CLKB_POFF_Val << PWM_CLK_DIVB_Pos)     /* (PWM_CLK) CLKB clock is turned off Position */
#define PWM_CLK_DIVB_PREB                     (PWM_CLK_DIVB_PREB_Val << PWM_CLK_DIVB_Pos)          /* (PWM_CLK) CLKB clock is clock selected by PREB Position */
#define PWM_CLK_PREB_Pos                      _UINT32_(24)                                         /* (PWM_CLK) CLKB Source Clock Selection Position */
#define PWM_CLK_PREB_Msk                      (_UINT32_(0xF) << PWM_CLK_PREB_Pos)                  /* (PWM_CLK) CLKB Source Clock Selection Mask */
#define PWM_CLK_PREB(value)                   (PWM_CLK_PREB_Msk & (_UINT32_(value) << PWM_CLK_PREB_Pos)) /* Assignment of value for PREB in the PWM_CLK register */
#define   PWM_CLK_PREB_CLK_Val                _UINT32_(0x0)                                        /* (PWM_CLK) Peripheral clock  */
#define   PWM_CLK_PREB_CLK_DIV2_Val           _UINT32_(0x1)                                        /* (PWM_CLK) Peripheral clock/2  */
#define   PWM_CLK_PREB_CLK_DIV4_Val           _UINT32_(0x2)                                        /* (PWM_CLK) Peripheral clock/4  */
#define   PWM_CLK_PREB_CLK_DIV8_Val           _UINT32_(0x3)                                        /* (PWM_CLK) Peripheral clock/8  */
#define   PWM_CLK_PREB_CLK_DIV16_Val          _UINT32_(0x4)                                        /* (PWM_CLK) Peripheral clock/16  */
#define   PWM_CLK_PREB_CLK_DIV32_Val          _UINT32_(0x5)                                        /* (PWM_CLK) Peripheral clock/32  */
#define   PWM_CLK_PREB_CLK_DIV64_Val          _UINT32_(0x6)                                        /* (PWM_CLK) Peripheral clock/64  */
#define   PWM_CLK_PREB_CLK_DIV128_Val         _UINT32_(0x7)                                        /* (PWM_CLK) Peripheral clock/128  */
#define   PWM_CLK_PREB_CLK_DIV256_Val         _UINT32_(0x8)                                        /* (PWM_CLK) Peripheral clock/256  */
#define   PWM_CLK_PREB_CLK_DIV512_Val         _UINT32_(0x9)                                        /* (PWM_CLK) Peripheral clock/512  */
#define   PWM_CLK_PREB_CLK_DIV1024_Val        _UINT32_(0xA)                                        /* (PWM_CLK) Peripheral clock/1024  */
#define PWM_CLK_PREB_CLK                      (PWM_CLK_PREB_CLK_Val << PWM_CLK_PREB_Pos)           /* (PWM_CLK) Peripheral clock Position */
#define PWM_CLK_PREB_CLK_DIV2                 (PWM_CLK_PREB_CLK_DIV2_Val << PWM_CLK_PREB_Pos)      /* (PWM_CLK) Peripheral clock/2 Position */
#define PWM_CLK_PREB_CLK_DIV4                 (PWM_CLK_PREB_CLK_DIV4_Val << PWM_CLK_PREB_Pos)      /* (PWM_CLK) Peripheral clock/4 Position */
#define PWM_CLK_PREB_CLK_DIV8                 (PWM_CLK_PREB_CLK_DIV8_Val << PWM_CLK_PREB_Pos)      /* (PWM_CLK) Peripheral clock/8 Position */
#define PWM_CLK_PREB_CLK_DIV16                (PWM_CLK_PREB_CLK_DIV16_Val << PWM_CLK_PREB_Pos)     /* (PWM_CLK) Peripheral clock/16 Position */
#define PWM_CLK_PREB_CLK_DIV32                (PWM_CLK_PREB_CLK_DIV32_Val << PWM_CLK_PREB_Pos)     /* (PWM_CLK) Peripheral clock/32 Position */
#define PWM_CLK_PREB_CLK_DIV64                (PWM_CLK_PREB_CLK_DIV64_Val << PWM_CLK_PREB_Pos)     /* (PWM_CLK) Peripheral clock/64 Position */
#define PWM_CLK_PREB_CLK_DIV128               (PWM_CLK_PREB_CLK_DIV128_Val << PWM_CLK_PREB_Pos)    /* (PWM_CLK) Peripheral clock/128 Position */
#define PWM_CLK_PREB_CLK_DIV256               (PWM_CLK_PREB_CLK_DIV256_Val << PWM_CLK_PREB_Pos)    /* (PWM_CLK) Peripheral clock/256 Position */
#define PWM_CLK_PREB_CLK_DIV512               (PWM_CLK_PREB_CLK_DIV512_Val << PWM_CLK_PREB_Pos)    /* (PWM_CLK) Peripheral clock/512 Position */
#define PWM_CLK_PREB_CLK_DIV1024              (PWM_CLK_PREB_CLK_DIV1024_Val << PWM_CLK_PREB_Pos)   /* (PWM_CLK) Peripheral clock/1024 Position */
#define PWM_CLK_Msk                           _UINT32_(0x0FFF0FFF)                                 /* (PWM_CLK) Register Mask  */


