MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/pwm.h
#define PWM_IDR2_CMPM_Pos                     _UINT32_(8)                                          /* (PWM_IDR2 Position) Comparison x Match Interrupt Disable */
#define PWM_IDR2_CMPM_Msk                     (_UINT32_(0xFF) << PWM_IDR2_CMPM_Pos)                /* (PWM_IDR2 Mask) CMPM */
#define PWM_IDR2_CMPM(value)                  (PWM_IDR2_CMPM_Msk & (_UINT32_(value) << PWM_IDR2_CMPM_Pos)) 
#define PWM_IDR2_CMPU_Pos                     _UINT32_(16)                                         /* (PWM_IDR2 Position) Comparison 7 Update Interrupt Disable */
#define PWM_IDR2_CMPU_Msk                     (_UINT32_(0xFF) << PWM_IDR2_CMPU_Pos)                /* (PWM_IDR2 Mask) CMPU */
#define PWM_IDR2_CMPU(value)                  (PWM_IDR2_CMPU_Msk & (_UINT32_(value) << PWM_IDR2_CMPU_Pos)) 

/* -------- PWM_IMR2 : (PWM Offset: 0x3C) ( R/ 32) PWM Interrupt Mask Register 2 -------- */
#define PWM_IMR2_WRDY_Pos                     _UINT32_(0)                                          /* (PWM_IMR2) Write Ready for Synchronous Channels Update Interrupt Mask Position */
#define PWM_IMR2_WRDY_Msk                     (_UINT32_(0x1) << PWM_IMR2_WRDY_Pos)                 /* (PWM_IMR2) Write Ready for Synchronous Channels Update Interrupt Mask Mask */
#define PWM_IMR2_WRDY(value)                  (PWM_IMR2_WRDY_Msk & (_UINT32_(value) << PWM_IMR2_WRDY_Pos)) /* Assignment of value for WRDY in the PWM_IMR2 register */
#define PWM_IMR2_UNRE_Pos                     _UINT32_(3)                                          /* (PWM_IMR2) Synchronous Channels Update Underrun Error Interrupt Mask Position */
#define PWM_IMR2_UNRE_Msk                     (_UINT32_(0x1) << PWM_IMR2_UNRE_Pos)                 /* (PWM_IMR2) Synchronous Channels Update Underrun Error Interrupt Mask Mask */
#define PWM_IMR2_UNRE(value)                  (PWM_IMR2_UNRE_Msk & (_UINT32_(value) << PWM_IMR2_UNRE_Pos)) /* Assignment of value for UNRE in the PWM_IMR2 register */
#define PWM_IMR2_CMPM0_Pos                    _UINT32_(8)                                          /* (PWM_IMR2) Comparison 0 Match Interrupt Mask Position */
#define PWM_IMR2_CMPM0_Msk                    (_UINT32_(0x1) << PWM_IMR2_CMPM0_Pos)                /* (PWM_IMR2) Comparison 0 Match Interrupt Mask Mask */
#define PWM_IMR2_CMPM0(value)                 (PWM_IMR2_CMPM0_Msk & (_UINT32_(value) << PWM_IMR2_CMPM0_Pos)) /* Assignment of value for CMPM0 in the PWM_IMR2 register */
#define PWM_IMR2_CMPM1_Pos                    _UINT32_(9)                                          /* (PWM_IMR2) Comparison 1 Match Interrupt Mask Position */
#define PWM_IMR2_CMPM1_Msk                    (_UINT32_(0x1) << PWM_IMR2_CMPM1_Pos)                /* (PWM_IMR2) Comparison 1 Match Interrupt Mask Mask */
#define PWM_IMR2_CMPM1(value)                 (PWM_IMR2_CMPM1_Msk & (_UINT32_(value) << PWM_IMR2_CMPM1_Pos)) /* Assignment of value for CMPM1 in the PWM_IMR2 register */
#define PWM_IMR2_CMPM2_Pos                    _UINT32_(10)                                         /* (PWM_IMR2) Comparison 2 Match Interrupt Mask Position */
#define PWM_IMR2_CMPM2_Msk                    (_UINT32_(0x1) << PWM_IMR2_CMPM2_Pos)                /* (PWM_IMR2) Comparison 2 Match Interrupt Mask Mask */
#define PWM_IMR2_CMPM2(value)                 (PWM_IMR2_CMPM2_Msk & (_UINT32_(value) << PWM_IMR2_CMPM2_Pos)) /* Assignment of value for CMPM2 in the PWM_IMR2 register */
#define PWM_IMR2_CMPM3_Pos                    _UINT32_(11)                                         /* (PWM_IMR2) Comparison 3 Match Interrupt Mask Position */
#define PWM_IMR2_CMPM3_Msk                    (_UINT32_(0x1) << PWM_IMR2_CMPM3_Pos)                /* (PWM_IMR2) Comparison 3 Match Interrupt Mask Mask */
#define PWM_IMR2_CMPM3(value)                 (PWM_IMR2_CMPM3_Msk & (_UINT32_(value) << PWM_IMR2_CMPM3_Pos)) /* Assignment of value for CMPM3 in the PWM_IMR2 register */
#define PWM_IMR2_CMPM4_Pos                    _UINT32_(12)                                         /* (PWM_IMR2) Comparison 4 Match Interrupt Mask Position */
#define PWM_IMR2_CMPM4_Msk                    (_UINT32_(0x1) << PWM_IMR2_CMPM4_Pos)                /* (PWM_IMR2) Comparison 4 Match Interrupt Mask Mask */
#define PWM_IMR2_CMPM4(value)                 (PWM_IMR2_CMPM4_Msk & (_UINT32_(value) << PWM_IMR2_CMPM4_Pos)) /* Assignment of value for CMPM4 in the PWM_IMR2 register */
#define PWM_IMR2_CMPM5_Pos                    _UINT32_(13)                                         /* (PWM_IMR2) Comparison 5 Match Interrupt Mask Position */
#define PWM_IMR2_CMPM5_Msk                    (_UINT32_(0x1) << PWM_IMR2_CMPM5_Pos)                /* (PWM_IMR2) Comparison 5 Match Interrupt Mask Mask */
#define PWM_IMR2_CMPM5(value)                 (PWM_IMR2_CMPM5_Msk & (_UINT32_(value) << PWM_IMR2_CMPM5_Pos)) /* Assignment of value for CMPM5 in the PWM_IMR2 register */
#define PWM_IMR2_CMPM6_Pos                    _UINT32_(14)                                         /* (PWM_IMR2) Comparison 6 Match Interrupt Mask Position */
#define PWM_IMR2_CMPM6_Msk                    (_UINT32_(0x1) << PWM_IMR2_CMPM6_Pos)                /* (PWM_IMR2) Comparison 6 Match Interrupt Mask Mask */
#define PWM_IMR2_CMPM6(value)                 (PWM_IMR2_CMPM6_Msk & (_UINT32_(value) << PWM_IMR2_CMPM6_Pos)) /* Assignment of value for CMPM6 in the PWM_IMR2 register */
#define PWM_IMR2_CMPM7_Pos                    _UINT32_(15)                                         /* (PWM_IMR2) Comparison 7 Match Interrupt Mask Position */
#define PWM_IMR2_CMPM7_Msk                    (_UINT32_(0x1) << PWM_IMR2_CMPM7_Pos)                /* (PWM_IMR2) Comparison 7 Match Interrupt Mask Mask */
#define PWM_IMR2_CMPM7(value)                 (PWM_IMR2_CMPM7_Msk & (_UINT32_(value) << PWM_IMR2_CMPM7_Pos)) /* Assignment of value for CMPM7 in the PWM_IMR2 register */
#define PWM_IMR2_CMPU0_Pos                    _UINT32_(16)                                         /* (PWM_IMR2) Comparison 0 Update Interrupt Mask Position */
#define PWM_IMR2_CMPU0_Msk                    (_UINT32_(0x1) << PWM_IMR2_CMPU0_Pos)                /* (PWM_IMR2) Comparison 0 Update Interrupt Mask Mask */
#define PWM_IMR2_CMPU0(value)                 (PWM_IMR2_CMPU0_Msk & (_UINT32_(value) << PWM_IMR2_CMPU0_Pos)) /* Assignment of value for CMPU0 in the PWM_IMR2 register */
#define PWM_IMR2_CMPU1_Pos                    _UINT32_(17)                                         /* (PWM_IMR2) Comparison 1 Update Interrupt Mask Position */
#define PWM_IMR2_CMPU1_Msk                    (_UINT32_(0x1) << PWM_IMR2_CMPU1_Pos)                /* (PWM_IMR2) Comparison 1 Update Interrupt Mask Mask */
#define PWM_IMR2_CMPU1(value)                 (PWM_IMR2_CMPU1_Msk & (_UINT32_(value) << PWM_IMR2_CMPU1_Pos)) /* Assignment of value for CMPU1 in the PWM_IMR2 register */
#define PWM_IMR2_CMPU2_Pos                    _UINT32_(18)                                         /* (PWM_IMR2) Comparison 2 Update Interrupt Mask Position */
#define PWM_IMR2_CMPU2_Msk                    (_UINT32_(0x1) << PWM_IMR2_CMPU2_Pos)                /* (PWM_IMR2) Comparison 2 Update Interrupt Mask Mask */
#define PWM_IMR2_CMPU2(value)                 (PWM_IMR2_CMPU2_Msk & (_UINT32_(value) << PWM_IMR2_CMPU2_Pos)) /* Assignment of value for CMPU2 in the PWM_IMR2 register */
#define PWM_IMR2_CMPU3_Pos                    _UINT32_(19)                                         /* (PWM_IMR2) Comparison 3 Update Interrupt Mask Position */
#define PWM_IMR2_CMPU3_Msk                    (_UINT32_(0x1) << PWM_IMR2_CMPU3_Pos)                /* (PWM_IMR2) Comparison 3 Update Interrupt Mask Mask */
#define PWM_IMR2_CMPU3(value)                 (PWM_IMR2_CMPU3_Msk & (_UINT32_(value) << PWM_IMR2_CMPU3_Pos)) /* Assignment of value for CMPU3 in the PWM_IMR2 register */
#define PWM_IMR2_CMPU4_Pos                    _UINT32_(20)                                         /* (PWM_IMR2) Comparison 4 Update Interrupt Mask Position */
#define PWM_IMR2_CMPU4_Msk                    (_UINT32_(0x1) << PWM_IMR2_CMPU4_Pos)                /* (PWM_IMR2) Comparison 4 Update Interrupt Mask Mask */
#define PWM_IMR2_CMPU4(value)                 (PWM_IMR2_CMPU4_Msk & (_UINT32_(value) << PWM_IMR2_CMPU4_Pos)) /* Assignment of value for CMPU4 in the PWM_IMR2 register */
#define PWM_IMR2_CMPU5_Pos                    _UINT32_(21)                                         /* (PWM_IMR2) Comparison 5 Update Interrupt Mask Position */
#define PWM_IMR2_CMPU5_Msk                    (_UINT32_(0x1) << PWM_IMR2_CMPU5_Pos)                /* (PWM_IMR2) Comparison 5 Update Interrupt Mask Mask */
#define PWM_IMR2_CMPU5(value)                 (PWM_IMR2_CMPU5_Msk & (_UINT32_(value) << PWM_IMR2_CMPU5_Pos)) /* Assignment of value for CMPU5 in the PWM_IMR2 register */
#define PWM_IMR2_CMPU6_Pos                    _UINT32_(22)                                         /* (PWM_IMR2) Comparison 6 Update Interrupt Mask Position */
#define PWM_IMR2_CMPU6_Msk                    (_UINT32_(0x1) << PWM_IMR2_CMPU6_Pos)                /* (PWM_IMR2) Comparison 6 Update Interrupt Mask Mask */
#define PWM_IMR2_CMPU6(value)                 (PWM_IMR2_CMPU6_Msk & (_UINT32_(value) << PWM_IMR2_CMPU6_Pos)) /* Assignment of value for CMPU6 in the PWM_IMR2 register */
#define PWM_IMR2_CMPU7_Pos                    _UINT32_(23)                                         /* (PWM_IMR2) Comparison 7 Update Interrupt Mask Position */
#define PWM_IMR2_CMPU7_Msk                    (_UINT32_(0x1) << PWM_IMR2_CMPU7_Pos)                /* (PWM_IMR2) Comparison 7 Update Interrupt Mask Mask */
#define PWM_IMR2_CMPU7(value)                 (PWM_IMR2_CMPU7_Msk & (_UINT32_(value) << PWM_IMR2_CMPU7_Pos)) /* Assignment of value for CMPU7 in the PWM_IMR2 register */
#define PWM_IMR2_Msk                          _UINT32_(0x00FFFF09)                                 /* (PWM_IMR2) Register Mask  */

